Revit 2024 API
ViewExportingEventArgs Properties
The ViewExportingEventArgs type exposes the following members.
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitAPIEventArgs.)
Document
 The document associated with the event.
 (Inherited from RevitAPIPreDocEventArgs.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RevitAPIEventArgs.)
ViewId
 Identifies the view about to be exported.
See Also
ViewExportingEventArgs Class
Autodesk.Revit.DB.Events Namespace